In [1]:
import pandas as pd
import numpy as np

In [2]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [3]:
pd.merge(registrations,logins,how='outer',on='name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [7]:
registrations=registrations.set_index('name')

In [8]:
pd.merge(registrations,logins,left_index=True,right_on='name',how='inner') # 要合併的欄位名稱不同

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [9]:
registrations=registrations.reset_index()

In [10]:
registrations.columns=['reg_name','reg_id']

In [12]:
pd.merge(registrations,logins,how='inner',left_on='reg_name',right_on='name') # drop the duplicate columns afterwards

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [13]:
registrations.columns=['name','id']
logins.columns=['id','name']

In [14]:
pd.merge(registrations,logins,how='inner',on='name',suffixes=('_reg','_log')) # add suffixes too duplicate column

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4

In [15]:
email="men@gmail.com"

In [16]:
email.upper()

'MEN@GMAIL.COM'

In [19]:
names=pd.Series(['david','brown','zazch','sheldon'])
names

0      david
1      brown
2      zazch
3    sheldon
dtype: object

In [22]:
names.str.upper() # 只用.upper()會出錯

0      DAVID
1      BROWN
2      ZAZCH
3    SHELDON
dtype: object

In [28]:
tickers =pd.Series(['GOOG,APPL,AMZN','JPM,BAC,GS'])

In [29]:
tickers

0    GOOG,APPL,AMZN
1        JPM,BAC,GS
dtype: object

In [31]:
tickers.str.split(',',expand=True)

      0     1     2
0  GOOG  APPL  AMZN
1   JPM   BAC    GS

In [32]:
messy_names = pd.Series(["andrew  ","bo;bo","  claire  "])

In [34]:
messy_names.str.replace(";","").str.strip()

0    andrew
1      bobo
2    claire
dtype: object

In [35]:
def cleanup(name):
    name = name.replace(";","").strip().capitalize()
    return name

In [37]:
messy_names.apply(cleanup) # 處理速度較快  np.vectorize(cleanup)(messy_names) 速度又更快

0    Andrew
1      Bobo
2    Claire
dtype: object

In [2]:
from datetime import datetime

In [3]:
nyear=2023
nmonth=11
nday=15
nhour=10
nminute=20
nsecond=30

In [4]:
mydate=datetime(nyear,nmonth,nday,nhour,nminute,nsecond)
mydate

datetime.datetime(2023, 11, 15, 10, 20, 30)

In [6]:
mydate.year, mydate.day

(2023, 15)

In [7]:
style='12--Dec--2023'
pd.to_datetime(style,format='%d--%b--%Y') # 把自定義的格式傳入

Timestamp('2023-12-12 00:00:00')

In [11]:
strange_date = '12th of Dec 2000'
pd.to_datetime(strange_date) # 文字也可以讀取

Timestamp('2000-12-12 00:00:00')

In [12]:
sales = pd.read_csv('UNZIP_FOR_NOTEBOOKS_FINAL/03-Pandas/RetailSales_BeerWineLiquor.csv')
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [15]:
sales.iloc[0]['DATE']

'1992-01-01'

In [16]:
sales['DATE']= pd.to_datetime(sales['DATE'])

In [19]:
type(sales.iloc[0][0])

pandas._libs.tslibs.timestamps.Timestamp

In [23]:
sales = pd.read_csv('UNZIP_FOR_NOTEBOOKS_FINAL/03-Pandas/RetailSales_BeerWineLiquor.csv',parse_dates=[0]) 
#指定什麼欄位要變成日期格式

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [25]:
sales['DATE'].dt.month  # 因為是在pandas裡面，要加上dt

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int64

In [26]:
import os

In [27]:
os.getcwd()

'C:\\Users\\maztl\\機器學習_udemy'

In [29]:
df = pd.read_csv('UNZIP_FOR_NOTEBOOKS_FINAL/03-Pandas/example.csv',header=None,index_col=0) 
# header把原始的欄位名稱當成資料列  index_col 指定欄位當成index column
df

     1   2   3
0
a    b   c   d
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [30]:
excel_sheets=pd.read_excel('UNZIP_FOR_NOTEBOOKS_FINAL/03-Pandas/my_excel_file.xlsx',sheet_name=None) # 會輸出稱dictb

In [36]:
excel_sheets.keys()

dict_keys(['First_Sheet'])

In [37]:
excel_sheets['First_Sheet']

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [35]:
pd.ExcelFile('UNZIP_FOR_NOTEBOOKS_FINAL/03-Pandas/my_excel_file.xlsx').sheet_names # 找出這個檔案裡所有的文件名稱

['First_Sheet']